In [2]:
import yfinance as yf
import pandas as pd

In [30]:
pd.set_option('display.max_rows', 5)

In [31]:
dataF = yf.download("AAPL", start="2023-5-20", end="2023-6-20", interval='15m')
dataF

[*********************100%***********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Datetime,,,,,,
2023-05-22 09:30:00,173.979996,174.710007,173.649994,174.250000,174.250000,5363774
2023-05-22 09:45:00,174.225006,174.679993,173.985001,174.019897,174.019897,2494952
...,...,...,...,...,...,...
2023-06-16 15:30:00,184.919998,185.100006,184.710098,184.737900,184.737900,2358242
2023-06-16 15:45:00,184.735001,185.350006,184.270004,185.020004,185.020004,5864734

In [32]:
dataF.tail(2)

,Open,High,Low,Close,Adj Close,Volume
Datetime,,,,,,
2023-06-16 15:30:00,184.919998,185.100006,184.710098,184.737900,184.737900,2358242
2023-06-16 15:45:00,184.735001,185.350006,184.270004,185.020004,185.020004,5864734

In [33]:
dataF.head(2)

,Open,High,Low,Close,Adj Close,Volume
Datetime,,,,,,
2023-05-22 09:30:00,173.979996,174.710007,173.649994,174.250000,174.250000,5363774
2023-05-22 09:45:00,174.225006,174.679993,173.985001,174.019897,174.019897,2494952

In [34]:
dataF.shape

(494, 6)

In [35]:
dataF.High

Datetime
2023-05-22 09:30:00    174.710007
2023-05-22 09:45:00    174.679993
                          ...
2023-06-16 15:30:00    185.100006
2023-06-16 15:45:00    185.350006
Name: High, Length: 494, dtype: float64

In [36]:
dataF.columns

Index(['Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [37]:
dataF[['Open', 'Close']]

                           Open       Close
Datetime
2023-05-22 09:30:00  173.979996  174.250000
2023-05-22 09:45:00  174.225006  174.019897
...                         ...         ...
2023-06-16 15:30:00  184.919998  184.737900
2023-06-16 15:45:00  184.735001  185.020004

[494 rows x 2 columns]

In [38]:
dataF.iloc[0]

Open         1.739800e+02
High         1.747100e+02
                 ...
Adj Close    1.742500e+02
Volume       5.363774e+06
Name: 2023-05-22 09:30:00, Length: 6, dtype: float64

In [44]:
dataF.iloc[0:3,[0, 1]]

                           Open        High
Datetime
2023-05-22 09:30:00  173.979996  174.710007
2023-05-22 09:45:00  174.225006  174.679993
2023-05-22 10:00:00  174.014999  174.250000

In [45]:
# Using this syntax returns a series rather than a df
dataF['Open']

Datetime
2023-05-22 09:30:00    173.979996
2023-05-22 09:45:00    174.225006
                          ...
2023-06-16 15:30:00    184.919998
2023-06-16 15:45:00    184.735001
Name: Open, Length: 494, dtype: float64